{
    "projects": [
        {
            "id": "1",
            "title": "SunnyMart (Academic Project)",
            "description": "'SunnyMart' is an e-commerce application designed to manage sales transactions with features such as real-time stock management, accurate transaction recording, and detailed financial reporting. Built using PHP with the Laravel framework and MySQL database, along with front-end technologies like HTML, CSS, Bootstrap, and JavaScript, this application ensures an appealing and responsive interface. With this application, SunnyMart can improve operational efficiency, monitor product availability, manage stock replenishment, track sales more effectively, and make better business decisions based on accurate data.",
            "role": "My role in this project was as a Backend Developer, partially as a Frontend Developer, and also as a Team Leader. I was responsible for developing the backend features of the 'SunnyMart' application and ensuring the application runs smoothly and meets user needs. Additionally, I acted as the team leader, coordinating and leading the development team to achieve project goals effectively and efficiently while ensuring the quality of the code produced by the team.",
            "role_title": "Backend Developer, Frontend Developer, Team Leader",
            "timeline": "May 2024 - June 2024",
            "images": [
                "sunnymart (1).jpg",
                "sunnymart (2).jpg",
                "sunnymart (3).jpg",
                "sunnymart (4).jpg",
                "sunnymart (5).png",
                "sunnymart (6).png",
                "sunnymart (7).png",
                "sunnymart (8).png",
                "sunnymart (9).png",
                "sunnymart (10).png",
                "sunnymart (11).png",
                "sunnymart (12).png",
                "sunnymart (13).png",
                "sunnymart (14).png",
                "sunnymart (15).png",
                "sunnymart (16).png",
                "sunnymart (17).png",
                "sunnymart (18).png",
                "sunnymart (19).png",
                "sunnymart (20).png"
            ]
        },
        {
            "id": "2",
            "title": "KlinikQ v1 ",
            "description": "KlinikQ is a web-based application designed to efficiently manage pharmacy consortiums. The application offers advanced features such as real-time drug stock management, electronic prescription services, patient data management, and automated reporting and analytics. With a user-friendly interface and high-level data security, KlinikQ simplifies every aspect of pharmacy operations, from stock monitoring to customer service. This solution ensures that pharmacies operate more organized, responsive, and well-connected between pharmacies, doctors, and patients. Built using PHP with the Laravel framework and MySQL database, as well as front-end technologies like HTML, CSS, Bootstrap, and JavaScript, this application ensures an appealing and responsive interface.",
            "role": "My role in this project was as a Frontend Developer. I was responsible for developing the user interface of the 'KlinikQ' application and ensuring the application was user-friendly and attractive to users. I also played a role in designing and implementing the necessary front-end features to meet user needs and ensure high-quality user interfaces.",
            "timeline": "February 2023",
            "role_title": "Frontend Developer & Junior Developer",
            "images": [
                "klinikq (1).png",
                "klinikq (2).png",
                "klinikq (3).png",
                "klinikq (4).png",
                "klinikq (5).png",
                "klinikq (6).png",
                "klinikq (7).png",
                "klinikq (8).png",
                "klinikq (9).png",
                "klinikq (10).png",
                "klinikq (11).png",
                "klinikq (12).png",
                "klinikq (13).png",
                "klinikq (14).png",
                "klinikq (15).png"
            ]
        },
        {
            "id": "3",
            "title": "PintaRS v1",
            "description": "PintaRS is an advanced information system designed to simplify clinic management for users. With innovative features, PintaRS enables clinic managers to efficiently and timely manage patient schedules, medical information, and administrative activities. The system not only provides an intuitive and easy-to-use interface but also offers seamless integration with various medical devices and other healthcare information systems. PintaRS delivers a comprehensive solution to maximize clinic operational efficiency, enhance patient service, and ensure compliance with applicable healthcare regulations. Built using PHP with the Laravel framework and MySQL database, as well as front-end technologies like HTML, CSS, Bootstrap, and JavaScript, this application ensures an appealing and responsive interface.",
            "role": "My role in this project was as a Fullstack Developer. I was responsible for developing several backend and frontend features of the 'PintaRS' application and ensuring the application runs smoothly and meets user needs. I also contributed to designing and implementing the necessary features to meet user requirements and ensure a high-quality user interface.",
            "timeline": "March 2024 - May 2024",
            "role_title": "Fullstack Developer & Junior Developer",
            "images": [
                "pintars (1).png",
                "pintars (2).png",
                "pintars (3).png",
                "pintars (4).png",
                "pintars (5).png",
                "pintars (6).png",
                "pintars (7).png",
                "pintars (8).png",
                "pintars (9).png",
                "pintars (10).png",
                "pintars (11).png",
                "pintars (12).png",
                "pintars (13).png",
                "pintars (14).png",
                "pintars (15).png",
                "pintars (16).png",
                "pintars (17).png",
                "pintars (18).png",
                "pintars (19).png",
                "pintars (20).png",
                "pintars (21).png",
                "pintars (22).png",
                "pintars (23).png",
                "pintars (24).png",
                "pintars (25).png",
                "pintars (26).png",
                "pintars (27).png",
                "pintars (28).png",
                "pintars (29).png",
                "pintars (30).png",
                "pintars (31).png",
                "pintars (32).png",
                "pintars (33).png",
                "pintars (34).png",
                "pintars (35).png",
                "pintars (36).png",
                "pintars (37).png"
            ]
        },
        {
            "id": "4",
            "title": "RentRide (Solo Project)",
            "description": "RentRide is a car rental platform designed to provide a seamless and efficient rental experience. With a user-friendly interface and advanced features, RentRide makes it easy for users to search, select, and rent vehicles according to their needs. The application offers various features to enhance usability, including vehicle search based on specific criteria, quick booking, and flexible rental schedule management. Designed with the latest technologies and a responsive interface, RentRide ensures a convenient experience for all users, whether for daily trips or long-term needs. As the sole developer, I was involved in developing various features and ensuring the application runs smoothly, meets high-quality standards, and provides the best solutions for users in finding and renting cars.",
            "role": "Solo Project",
            "role_title": "Fullstack Developer",
            "timeline": "August 2024 ",
            "images": [
                "rentalmobil (1).png",
                "rentalmobil (2).png",
                "rentalmobil (3).png",
                "rentalmobil (4).png",
                "rentalmobil (5).png",
                "rentalmobil (6).png",
                "rentalmobil (7).png",
                "rentalmobil (8).png",
                "rentalmobil (9).png"
            ]
        }
    ]
}